CSI API ETABS v1
cDStChinese_2018.SetPreference Method
 Sets the value of a steel design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPreference(
	int Item,
	double Value
)
Function SetPreference (
	Item As Integer,
	Value As Double
) As Integer
Dim instance As cDStChinese_2018
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.SetPreference(Item,
	Value)
int SetPreference(
	int Item,
	double Value
)
abstract SetPreference :
        Item : int *
        Value : float -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 29, inclusive, indicating the preference item considered.
Multi-Response Case Designn
Framing Type
Seismic Design Grade
Ignore b/t Check?
Classify Beam as Flexo-Compression Member?
Analysis Method
Stability Factor
Ignore Beam PhiB?
Reserved for Future Use
Reserved for Future Use
Consider Deflection?
LL deflection limit, L/Value
Total Load Deflection Limit, L/Value
Total - Camber Limit, L/Value
Reserved for Future Use
Reserved for Future Use
Reserved for Future Use
Reserved for Future Use
Reserved for Future Use
Reserved for Future Use
Demand/Capacity Ratio Limit
Maximum Number of Auto Iterations
Value
Type: System.Double
 The value of the considered preference item.
 Multi-Response Case Designn
Envelopes
Step-by-step
Last step
Envelopes -- All
Step-by-step -- All
 Framing Type
Sway Moment Frame, SMF
Concentrically Braced Frame, CBF
Eccentrically Braced Frame, EBF
NonSway Moment Frame, NMF
 Seismic Design Grade
Grade I
Grade II
Grade III
Grade IV
Non Seismic
 Ignore b/t Check?
0 = No
Any other value = Yes
 Classify Beam as Flexo-Compression Member?
0 = No
Any other value = Yes
 Analysis Method
Direct Analysis
Second Order
Amplified 1st Order
Limited 1st Order
 Stability Factor
Value > 0
 Ignore Beam PhiB?
0 = No
Any other value = Yes
Reserved for Future Use
Reserved for Future Use
 Consider deflection
0 = No
Any other value = Yes
 LL deflection limit, L/Value
Value > 0
 Total Load Deflection Limit, L/Value
Value > 0
 Total - Camber Limit, L/Value
Value > 0
Reserved for Future Use
Reserved for Future Use
Reserved for Future Use
Reserved for Future Use
Reserved for Future Use
Reserved for Future Use
 Demand/Capacity Ratio Limit
Value > 0
 Maximum Number of Auto Iterations
Value >= 1
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
Remarks
See Also
Reference
cDStChinese_2018 Interface
ETABSv1 Namespace